# Brewfile - Homebrew Bundle configuration

# Taps
tap "FelixKratz/formulae"
tap "dotenvx/brew"
tap "hashicorp/tap"
tap "homebrew/services"
tap "minamijoyo/hcledit"
tap "nikitabobko/tap"

# Formulae (brews)
brew "act"
brew "ansible"
brew "argocd"
brew "atuin"
brew "awscli"
brew "azure-cli"
brew "bash"
# brew "borders"
brew "bitwarden-cli"
brew "checkov"
brew "crossplane"
brew "cryptography"
brew "eza"
brew "direnv"
brew "docutils"
brew "dotenvx"
brew "dtc"
brew "earthly"
brew "fd"
brew "fish"
brew "fisher"
brew "fontconfig"
brew "fzf"
brew "gh"
brew "git-filter-repo"
brew "gnu-sed"
brew "go-task"
brew "goenv"
brew "helm"
brew "jfrog-cli"
brew "jj"
brew "jq"
brew "kind"
brew "krew"
brew "kubebuilder"
brew "kubectx"
brew "kubent"
brew "kubernetes-cli"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "lsd"
brew "lua"
brew "make"
brew "neofetch"
brew "neovim"
brew "node"
brew "oci-cli"
brew "podman"
brew "pre-commit"
brew "protobuf"
brew "proton-mail"
brew "proton-drive"
brew "pyenv"
brew "qemu"
brew "ripgrep"
brew "sesh"
brew "sops"
brew "starship"
brew "stern"
brew "stow"
brew "talos"
brew "telnet"
brew "terraform-docs"
brew "terragrunt"
brew "terrascan"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tfupdate"
brew "tldr"
brew "tmux"
brew "tree"
brew "watch"
brew "yazi"
brew "yq"
brew "yubikey-agent"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-vi-mode"
brew "zstd"
# brew "packer"
# brew "espanso"
# brew "hcledit"
# brew "sketchybar"
# brew "docker"
# brew "docker-completion"
# brew "docker-compose"
# brew "docker-credential-helper"
# brew "go" # use goenv instead

# Casks
cask "1password-cli"
cask "aerospace"
cask "arc"
cask "betterdisplay"
cask "bitwarden"
cask "brave-browser"
cask "chromium"
cask "cleanshot"
cask "contexts"
cask "drawio"
cask "font-commit-mono"
cask "google-chrome"
cask "google-cloud-sdk"
cask "inkdrop"
cask "keycastr"
cask "meetingbar"
cask "mission-control-plus"
cask "paintbrush"
cask "podman-desktop"
cask "raycast"
cask "slack"
cask "spacelauncher"
cask "stats"
cask "utm"
cask "wezterm"
